; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	image1 - mode
	infrared0 - mode
	thermograph2 - mode
	star0 - direction
	groundstation1 - direction
	groundstation2 - direction
	star3 - direction
	planet4 - direction
	planet5 - direction
	planet6 - direction
	star7 - direction
	planet8 - direction
	star9 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 infrared0)
	(supports instrument0 image1)
	(calibration_target instrument0 groundstation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 planet5)
)
(:goal (and
	(have_image star3 thermograph2)
	(have_image planet4 infrared0)
	(have_image planet5 image1)
	(have_image planet6 image1)
	(have_image star7 infrared0)
	(have_image planet8 image1)
	(have_image star9 infrared0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
2. (turn_to satellite0 groundstation2 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 7
3. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 0 of 7
4. (turn_to satellite0 planet4 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 planet4)
   goals met: 0 of 7
5. (take_image satellite0 planet4 instrument0 infrared0)
   added: (have_image planet4 infrared0)
   goals met: 1 of 7
6. (turn_to satellite0 planet5 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 planet5)
   goals met: 1 of 7
7. (take_image satellite0 planet5 instrument0 image1)
   added: (have_image planet5 image1)
   goals met: 2 of 7
8. (turn_to satellite0 planet6 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 planet6)
   goals met: 2 of 7
9. (take_image satellite0 planet6 instrument0 image1)
   added: (have_image planet6 image1)
   goals met: 3 of 7
10. (turn_to satellite0 planet8 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet8)
   goals met: 3 of 7
11. (take_image satellite0 planet8 instrument0 image1)
   added: (have_image planet8 image1)
   goals met: 4 of 7
12. (turn_to satellite0 star3 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star3)
   goals met: 4 of 7
13. (take_image satellite0 star3 instrument0 thermograph2)
   added: (have_image star3 thermograph2)
   goals met: 5 of 7
14. (turn_to satellite0 star7 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star7)
   goals met: 5 of 7
15. (take_image satellite0 star7 instrument0 infrared0)
   added: (have_image star7 infrared0)
   goals met: 6 of 7
16. (turn_to satellite0 star9 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star9)
   goals met: 6 of 7
17. (take_image satellite0 star9 instrument0 infrared0)
   added: (have_image star9 infrared0)
   goals met: 7 of 7
